# Toposolid Create From Topography Surface Method

Source: https://www.revitapidocs.com/2026/662a7ccb-63b9-a106-1b3e-659af6a35c70.htm

---

| Toposolid Create From Topography Surface Method |
| --- |

Creates a Toposolid element from a host TopographySurface, and Toposolid sub\-divisions from its subregions.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Toposolid CreateFromTopographySurface(
	Document document,
	ElementId hostSurfaceId,
	ElementId topoTypeId,
	ElementId levelId
)
```

```
Public Shared Function CreateFromTopographySurface (
	document As Document,
	hostSurfaceId As ElementId,
	topoTypeId As ElementId,
	levelId As ElementId
) As Toposolid
```

```
public:
static Toposolid^ CreateFromTopographySurface(
	Document^ document,
	ElementId^ hostSurfaceId,
	ElementId^ topoTypeId,
	ElementId^ levelId
)
```

```
static member CreateFromTopographySurface :
        document : Document *
        hostSurfaceId : ElementId *
        topoTypeId : ElementId *
        levelId : ElementId -> Toposolid
```

#### Parameters

document Document
:   The document in which the new Toposolid is created.

hostSurfaceId ElementId
:   Id of the host TopogarphySurface element.

topoTypeId ElementId
:   Id of the Toposolid type to be used by the new Toposolid.

levelId ElementId
:   Id of the level on which the Toposolid is to be placed.

#### Return Value

Toposolid
A new Toposolid object within the project if successful. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

Toposolid Class Autodesk.Revit.DB Namespace